package cn.com.tw.common.protocol.gehua.cons;

/**
 * 歌华DTU寄存器列表
 * @author admin
 *
 */
public class RegisterAddr {
	
	/**
	 * key数组
	 *         {"DTU编号","硬件版本号","软件版本号",
        "工作模式","功能位","射频波特率","心跳间隔","设备数量","上报间隔",
        "保留字节",
        "厂家ID1","设备类型1","设备ID1","软件版本1","协议版本1","保留字节1",
        "厂家ID2","设备类型2","设备ID2","软件版本2","协议版本2","保留字节2",
        "厂家ID3","设备类型3","设备ID3","软件版本3","协议版本3","保留字节3",
        "厂家ID4","设备类型4","设备ID4","软件版本4","协议版本4","保留字节4",
        "厂家ID5","设备类型5","设备ID5","软件版本5","协议版本5","保留字节5"};
	 */
	public static String[] KeyArray =
        {"DID","DHV","DSV",
        "WMD","DFB","Baud","HBI","EN","RI",
        "RGBR",
        "FID1","ET1","EID1","SV1","PV1","RGBR1",
        "FID2","ET2","EID2","SV2","PV2","RGBR2",
        "FID3","ET3","EID3","SV3","PV3","RGBR3",
        "FID4","ET4","EID4","SV4","PV4","RGBR4",
        "FID5","ET5","EID5","SV5","PV5","RGBR5"};
	
	/**
	 * 寄存器地址数组
	 */
	public static String[] AddArray =
        {"00","08","09",
        "0A","0B","0C","0D","0F","10",
        "12",
        "1A","1C","1E","22","26","2A",
        "2E","30","32","36","3A","3E",
        "42","44","46","4A","4E","52",
        "56","58","5A","5E","62","66",
        "6A","6C","6E","72","76","7A"};
	
	/**
	 * 数据格式数组
	 */
	public static String[] formatArray =
        {"h16","2","2",
        "b2","b2","2","h4","h2","h4",
        "16",
        "4","4","h8","8","8","8",
        "4","4","h8","8","8","8",
        "4","4","h8","8","8","8",
        "4","4","h8","8","8","8",
        "4","4","h8","8","8","8"};
}
